1.	Вы работаете над модулем внутрикорпоративной системы учета данных сотрудников компании.  

**_Программа должна:_**  

•	Найти сотрудника с минимальным возрастом;  
•	Вычислить медианный возраст всех сотрудников.  
•	Найти сотрудника с максимальным возрастом.  

Медиана — число, которое находится в середине этого набора, если его упорядочить по возрастанию. Если набор чисел четный, то берется среднее между двумя средними числами и округляется до целого.  

**Формат ввода:**  
Первая строка содержит данные сотрудников. Данные включают имя, возраст и отдел, разделенные запятой, без пробелов. Информация о каждом сотруднике отделена от других через точку с запятой. Количество сотрудников — от 2 до 100.

**Формат вывода:**  
Вторая строка содержит три целых числа, разделенные пробелом: минимальный возраст, медианный возраст и максимальный возраст.  

**Пример 1:**  
-_Входные данные:_  
Иван,28,Инженер;Олег,34,HR;Денис,45,Маркетинг;Анна,30,Инженер;Борис,24,HR  
-_Выходные данные:_  
24 30 45  

**Пример 2:**  
_Входные данные:_  
Павел,28,Инженер;Елена,34,Маркетинг  
_Выходные данные:_   
28 31 34

**Макет кода:**  
`def process_employee_data(input_string: str) -> str:  
    """Ваш код"""

input_data = input()  
output_data = process_employee_data(input_data)  
print(output_data)`
